[
  {
    "id": 0,
    "name": "Введение",
    "image": "https://github.com/JackMops12/react/blob/master/python/image/python1.jpeg",
    "info": "Почему стоит изучать Python? Python является самым простым в обучении языком. Даже школьник при желании может овладеть основами данного языка, и писать всё что угодно - от простых игр на Pygame, до биржевых роботов на основе нейросетей. Судя по рейтингу языков программирования, Python стремительно набирает популярность. Поэтому вы смело можете выбирать данный язык для изучения!"
  },
  {
    "id": 1,
    "name": "Установка",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_The_Ark_of_Truth.jpg",
    "info": "Самой распространённой операционной системой является Windows, поэтому установим Python сюда. Для этого: 1.Cкачиваем последнюю весрию с официального сайта и запускаем установщик.2.На первом экране усатновки нужно поставить галочку на против: Add Python to PATH. На этом установка Python завершена. До следущего урока!"
  },
  {
    "id": 2,
    "name": "Переменные",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_Continuum.jpg",
    "info": "Переменная - это ячейка памяти, которая имеет какое-то имя, а внутри лежит информация, которая имеет какой-то тип. Пример: box1 = 15 (де box1 - имя ячейки, 15 - информация внутри ячейки) Все переменные можно складывать (box3 = box2 + box1), и выводить ответ (box3) командой print. Теперь это можно оформить в виде простой программы и внести её в IDLE. И теперь при нажатии на F5 будет выведено число 25. Давайте научим программу получать данные от пользователя. Для этого используется команда input:box1 = input('Введите число') Кроме чисел можно вводить и слова. Следует запомнить, что числа не обособляются ни чем:a = 12 b = 'А слова обособляются либо одинарными кавычками, либо двойными' Внимание! Если при просьбе ввести число, мы введем (например 1), то программа посчитает это как строчку. Но чтобы это изменить нужно воспользоваться командой int(), а обратно str(). Это команды преобразователи - преобразуют строку в число, и обратно. На этом всё. До следущего урока!"
  },
  {
    "id": 3,
    "name": "Условие",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_SG_1.jpg",
    "info": "Сегодня мы поговорим о условии в Python. Данная конструкция состоит из: начала (if), условия и противоречия (else):if (некое условие):#некое действие else: #некое действие. Стоит запомнить то, что если мы сравниваем числа (переменные), то для этого используются свои операторы: == - знак равенства. != - знак не равенства. > - знак больше. < - знак меньше. >= - знак больше или равно. <= - знак меньше или равно. Теперь полученные навыки применим для создания программы. На этом всё, в следущем уроке мы разберём сложные условия. До следущего урока!"
  }
]
