[
  {
    "id": 0,
    "name": "Введение",
    "image": "https://github.com/JackMops12/react-native/blob/master/python/image/python1.jpeg",
    "info": "Почему стоит изучать Python? Python является самым простым в обучении языком. Даже школьник при желании может овладеть основами данного языка, и писать всё что угодно - от простых игр на Pygame, до биржевых роботов на основе нейросетей. Судя по рейтингу языков программирования, Python стремительно набирает популярность. Поэтому вы смело можете выбирать данный язык для изучения!"
  },
  {
    "id": 1,
    "name": "Установка",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_The_Ark_of_Truth.jpg",
    "info": "Самой распространённой операционной системой является Windows, поэтому установим Python сюда. Для этого: 1.Cкачиваем последнюю весрию с официального сайта и запускаем установщик.2.На первом экране усатновки нужно поставить галочку на против: Add Python to PATH. На этом установка Python завершена. До следущего урока!"
  },
  {
    "id": 2,
    "name": "Stargate: Continuum",
    "year": "2008",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_Continuum.jpg",
    "info": "Stargate: Continuum is a 2008 Canadian-American military science fiction direct-to-video film in the Stargate franchise. It is the second sequel to television series Stargate SG-1 following The Ark of Truth. It is directed by Martin Wood, director and producer of many episodes of Stargate SG-1 and Stargate Atlantis, written by SG-1 and Atlantis creator Brad Wright, and produced by Wright and Ark of Truth director Robert C. Cooper."
  },
  {
    "id": 3,
    "name": "Stargate SG-1",
    "year": "1997",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_SG_1.jpg",
    "info": "Targate SG-1 (often abbreviated as SG-1) is a Canadian-American military science fiction adventure television series and part of Metro-Goldwyn-Mayers Stargate franchise. The show, created by Brad Wright and Jonathan Glassner, is based on the 1994 science fiction film Stargate by Dean Devlin and Roland Emmerich. The television series was filmed in and around the city of Vancouver, British Columbia, Canada. The series premiered on Showtime on July 27, 1997 and moved to the Sci Fi Channel on June 7, 2002; the final episode first aired on Sky1 on March 13, 2007."
  },
  {
    "id": 4,
    "name": "Stargate Atlantis",
    "year": "2004",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_Atlantis.jpg",
    "info": "Stargate Universe (often abbreviated as SGU) is a Canadian-American military science fiction television series and part of MGMs Stargate franchise. It follows the adventures of a present-day, multinational exploration team traveling on the Ancient spaceship Destiny several billion light years distant from the Milky Way Galaxy. They evacuated there and are now trying to figure out a way to return to Earth, while simultaneously trying to explore and to survive in their unknown area of the universe. The series, created by Brad Wright and Robert C. Cooper, premiered in the United States on Syfy on October 2, 2009. The series featured an ensemble cast and was primarily filmed in and around Vancouver, BC, Canada. A second season of 20 episodes was announced by Syfy in December 2009"
  }
]
