[
  {
    "id": 0,
    "name": "Введение",
    "image": "https://raw.githubusercontent.com/JackMops12/react/master/pascal/image/pascal1.jpeg",
    "info": "Почему стоит изучать Pascal? Паскаль - это язык программирования, которому обучают в старших классах.Основная часть применения приходится на практическое задание во второй части ОГЭ. Мы будем работать в PascalABS.NET - глобальных отличий от простого Паскаля в нём нет! Для того чтобы установить компилятор для данного языка, нужно просто скачать его на официальном сайте и установить.На этом всё! На следующем уроке мы разберём устройство языка. До следующего урока!"
  },
  {
    "id": 1,
    "name": "Операторы",
    "image": "https://raw.githubusercontent.com/JackMops12/react/master/pascal/image/pascal2.jpeg",
    "info": "В данном уроке мы вам расскажем основные команды (операторы) для написания программы. (Примечание: в конце каждой строки ставится точка с запятой, кроме некоторых исключений.) Program (имя программы) — заголовок программы. Название программы не может начинаться с цифры, не должно совпадать с зарезервированными словами (операторами), с названиями переменных, а также символов (‘@’, ‘%’, ‘&’ и других), кроме подчеркивания. Const (константа, постоянная) — команда, для указания переменных с постоянной величиной: Const П:=3.14; Var — оператор, в котором прописываются все переменные программы и их тип. Переменные перечисляются через запятую, а после двоеточия указывается только тип.Begin (начало) — оператор, означающий начало основной программы, в которой записываются команды. После слова begin точка с запятой не ставится. End (конец программы), после последнего слова end всегда стоит точка. Если же конструкции begin – end является операторными скобками, которые применяются для объединения нескольких операций под одним оператором, то после end ставится ‘;’."
  },
  {
    "id": 2,
    "name": "Ввод и вывод",
    "image": "hhttps://raw.githubusercontent.com/JackMops12/react/master/pascal/image/pascal3.jpeg",
    "info": "В этом уроке мы вам расскажем об операторах, которые служат для ввода и вывода информации. Этими операторами являются read, readln, write, writeln и находятся в теле программы. Тело программы – это блок операторов, в котором записываются команды для выполнения. Начинается этот блок словом begin, а заканчивается словом end. Для ввода информации используется такой оператор, как read. Записывается как read(x), где x – любое число, текст, или другой тип переменной. Например, если нам нужно задать переменную x любым целым числом, то мы запишем это так: var x:integer; begin read(x); end. Для вывода информации используется такой оператор, как write. Этот оператор выводит на экран текст, помещенный в него. Текст выделяется синим и записывается так: write('Как тебя зовут?'); После выполнения этого оператора мы увидим на экране: Как тебя зовут? Кроме того этот оператор используется для вывода переменных с определённым значением и пояснения или комментария к этой переменной. Например, переменная x является длинной каната и равна 5 см. Это будет записываться так: write('Длина каната равна ', x, ' см'); После выполнения этого оператора мы увидим на экране:Длина каната равна 50 см.Операторы readln и writeln действуют аналогичные с операторами read и write только с переносом текста на новую строку."
  }
]
