[
  {
    "id": 0,
    "name": "Введение",
    "image": "https://raw.githubusercontent.com/JackMops12/react/master/python/image/python1.jpeg",
    "info": "Почему стоит изучать Pascal? Паскаль - это язык программирования, которому обучают в старших классах.Основная часть применения приходится на практическое задание во второй части ОГЭ. Мы будем работать в PascalABS.NET - глобальных отличий от простого Паскаля в нём нет! Для того чтобы установить компилятор для данного языка, нужно просто скачать его на официальном сайте и установить.На этом всё! На следующем уроке мы разберём устройство языка. До следующего урока!"
  },
  {
    "id": 1,
    "name": "Операторы",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_The_Ark_of_Truth.jpg",
    "info": "В данном уроке мы вам расскажем основные команды (операторы) для написания программы. (Примечание: в конце каждой строки ставится точка с запятой, кроме некоторых исключений.) Program (имя программы) — заголовок программы. Название программы не может начинаться с цифры, не должно совпадать с зарезервированными словами (операторами), с названиями переменных, а также символов (‘@’, ‘%’, ‘&’ и других), кроме подчеркивания. Const (константа, постоянная) — команда, для указания переменных с постоянной величиной: Const П:=3.14; Var — оператор, в котором прописываются все переменные программы и их тип. Переменные перечисляются через запятую, а после двоеточия указывается только тип.Begin (начало) — оператор, означающий начало основной программы, в которой записываются команды. После слова begin точка с запятой не ставится. End (конец программы), после последнего слова end всегда стоит точка. Если же конструкции begin – end является операторными скобками, которые применяются для объединения нескольких операций под одним оператором, то после end ставится ‘;’."
  },
  {
    "id": 2,
    "name": "Переменные",
    "image": "https://github.com/react-native-village/react-native-init/raw/master/stargate/images/Stargate_Continuum.jpg",
    "info": "Переменная - это ячейка памяти, которая имеет какое-то имя, а внутри лежит информация, которая имеет какой-то тип. Пример: box1 = 15 (де box1 - имя ячейки, 15 - информация внутри ячейки) Все переменные можно складывать (box3 = box2 + box1), и выводить ответ (box3) командой print. Теперь это можно оформить в виде простой программы и внести её в IDLE. И теперь при нажатии на F5 будет выведено число 25. Давайте научим программу получать данные от пользователя. Для этого используется команда input:box1 = input('Введите число') Кроме чисел можно вводить и слова. Следует запомнить, что числа не обособляются ни чем:a = 12 b = 'А слова обособляются либо одинарными кавычками, либо двойными' Внимание! Если при просьбе ввести число, мы введем (например 1), то программа посчитает это как строчку. Но чтобы это изменить нужно воспользоваться командой int(), а обратно str(). Это команды преобразователи - преобразуют строку в число, и обратно. На этом всё. До следущего урока!"
  }
]
